Frank-Bemelman/ESP32-Sonos-Jukebox-V3/code/SonosUPnP.h
#define SONOS_ATTRIB_TITLE "dc:title"
#define SONOS_ATTRIB_CREATOR "dc:creator"
#define SONOS_ATTRIB_ALBUM "upnp:album"
#define SONOS_ATTRIB_ARTIST "r:albumArtist"


#define SONOS_MAXSOURCE 14
                                  
#define SONOS_SOURCE_UNKNOWN_SCHEME "z-sonos-unknown:\0"
#define SONOS_SOURCE_SPOTIFY_SCHEME "x-sonos-spotify:\0"
#define SONOS_SOURCE_FILE_SCHEME "x-file-cifs:\0"
#define SONOS_SOURCE_LIBRARY_SCHEME "x-sonos-http:librarytrack\0"  // apple afspeellijsten
#define SONOS_SOURCE_HTTP_SCHEME "x-sonos-http:\0"
#define SONOS_SOURCE_RADIO_SCHEME "x-rincon-mp3radio:\0"
#define SONOS_SOURCE_RADIO_AAC_SCHEME "aac:\0"
#define SONOS_SOURCE_LINEIN_SCHEME "x-rincon-stream:\0"
#define SONOS_SOURCE_MASTER_SCHEME "x-rincon:\0"
#define SONOS_SOURCE_QUEUE_SCHEME "x-rincon-queue:\0"
#define SONOS_SOURCE_SPOTIFYSTATION_SCHEME "x-sonosprog-spotify:\0"
#define SONOS_SOURCE_LOCALHTTP_SCHEME "http:\0"
#define SONOS_SOURCE_LOCALHTTPS_SCHEME "https:\0"
#define SONOS_SOURCE_SPOTIFY_RADIO_SCHEME "x-sonos-vli:\0"  // apple afspeellijsten


#define SONOS_SOURCE_UNKNOWN 0
#define SONOS_SOURCE_SPOTIFY 1
#define SONOS_SOURCE_FILE 2
#define SONOS_SOURCE_LIBRARY 3
#define SONOS_SOURCE_HTTP 4
#define SONOS_SOURCE_RADIO 5
#define SONOS_SOURCE_RADIO_AAC 6
#define SONOS_SOURCE_LINEIN 7
#define SONOS_SOURCE_MASTER 8
#define SONOS_SOURCE_QUEUE 9
#define SONOS_SOURCE_SPOTIFYSTATION 10
#define SONOS_SOURCE_LOCALHTTP 11
#define SONOS_SOURCE_LOCALHTTPS 12
#define SONOS_SOURCE_SPOTIFY_RADIO 13


#define UNKNOWN_SCHEME "Unknown"
#define SPOTIFY_SCHEME "Spotify"
#define FILE_SCHEME "File"
#define LIBRARY_SCHEME "Libray"
#define HTTP_SCHEME "Http"      // sonos thema radio     , apple thema radio
#define RADIO_SCHEME "Radio"
#define RADIO_AAC_SCHEME "Radio AAC"
#define LINEIN_SCHEME "Line-In"
#define MASTER_SCHEME "Master"
#define QUEUE_SCHEME "Queue"
#define SPOTIFYSTATION_SCHEME "Spotify Station"
#define LOCALHTTP_SCHEME "Local Http"
#define LOCALHTTPS_SCHEME "Local Https"
#define SPOTIFY_RADIO_SCHEME "Spotify Radio"  



#define SONOS_TAG_GET_MEDIA_INFO "GetMediaInfo"
#define SONOS_TAG_GET_MEDIA_INFO_RESPONSE "u:GetMediaInfoResponse"
#define SONOS_TAG_CURRENTURIMETADATA "CurrentURIMetaData"


// Volume, bass & treble:
/*
<u:GetVolume>
  <InstanceID>0</InstanceID>
  <Channel>Master</Channel>
</u:GetVolume>
<u:GetVolumeResponse>
  <CurrentVolume>[0-100]</CurrentVolume>
</u:GetVolumeResponse>
*/
#define SONOS_TAG_CHANNEL "Channel"
#define SONOS_CHANNEL_MASTER "Master"
//#define SONOS_CHANNEL_LEFT "LF"
//#define SONOS_CHANNEL_RIGHT "RF"
#define SONOS_TAG_GET_MUTE "GetMute"
#define SONOS_TAG_GET_MUTE_RESPONSE "u:GetMuteResponse"
#define SONOS_TAG_CURRENT_MUTE "CurrentMute"
#define SONOS_TAG_GET_VOLUME "GetVolume"
#define SONOS_TAG_GET_VOLUME_RESPONSE "u:GetVolumeResponse"
#define SONOS_TAG_CURRENT_VOLUME "CurrentVolume"
#define SONOS_TAG_GET_OUTPUT_FIXED "GetOutputFixed"
#define SONOS_TAG_GET_FIXED_RESPONSE "u:GetOutputFixedResponse"
#define SONOS_TAG_CURRENT_FIXED "CurrentFixed"
#define SONOS_TAG_GET_BASS "GetBass"
#define SONOS_TAG_GET_BASS_RESPONSE "u:GetBassResponse"
#define SONOS_TAG_CURRENT_BASS "CurrentBass"
#define SONOS_TAG_GET_TREBLE "GetTreble"
#define SONOS_TAG_GET_TREBLE_RESPONSE "u:GetTrebleResponse"
#define SONOS_TAG_CURRENT_TREBLE "CurrentTreble"
#define SONOS_TAG_GET_LOUDNESS "GetLoudness"
#define SONOS_TAG_GET_LOUDNESS_RESPONSE "u:GetLoudnessResponse"
#define SONOS_TAG_CURRENT_LOUDNESS "CurrentLoudness"

// Set volume, bass & treble:
/*
<u:SetVolume>
  <InstanceID>0</InstanceID>
  <Channel>Master</Channel>
  <DesiredVolume>[0-100]</DesiredVolume>
</u:SetVolume>
*/
#define SONOS_TAG_SET_MUTE "SetMute"
#define SONOS_TAG_DESIRED_MUTE "DesiredMute"
#define SONOS_TAG_SET_VOLUME "SetVolume"
#define SONOS_TAG_DESIRED_VOLUME "DesiredVolume"
#define SONOS_TAG_SET_BASS "SetBass"
#define SONOS_TAG_DESIRED_BASS "DesiredBass"
#define SONOS_TAG_SET_TREBLE "SetTreble"
#define SONOS_TAG_DESIRED_TREBLE "DesiredTreble"
#define SONOS_TAG_SET_LOUDNESS "SetLoudness"
#define SONOS_TAG_DESIRED_LOUDNESS "DesiredLoudness"
#define SONOS_CHANNEL_TAG_START "<Channel>"
#define SONOS_CHANNEL_TAG_END "</Channel>"

// Play Mode:
/*
<u:GetTransportSettingsResponse>
  <PlayMode>[NORMAL/REPEAT_ALL/SHUFFLE/SHUFFLE_NOREPEAT]</PlayMode>
  <RecQualityMode>NOT_IMPLEMENTED</RecQualityMode>
</u:GetTransportSettingsResponse>
*/
#define SONOS_TAG_GET_TRANSPORT_SETTINGS "GetTransportSettings"
#define SONOS_TAG_GET_TRANSPORT_SETTINGS_RESPONSE "u:GetTransportSettingsResponse"
#define SONOS_TAG_PLAY_MODE "PlayMode"
#define SONOS_PLAY_MODE_NORMAL B00
#define SONOS_PLAY_MODE_NORMAL_VALUE "NORMAL"
#define SONOS_PLAY_MODE_REPEAT B01
#define SONOS_PLAY_MODE_REPEAT_VALUE "REPEAT_ALL"
#define SONOS_PLAY_MODE_SHUFFLE B10
#define SONOS_PLAY_MODE_SHUFFLE_VALUE "SHUFFLE_NOREPEAT"
#define SONOS_PLAY_MODE_SHUFFLE_REPEAT B11
#define SONOS_PLAY_MODE_SHUFFLE_REPEAT_VALUE "SHUFFLE"
// Set Play Mode:
#define SONOS_TAG_SET_PLAY_MODE "SetPlayMode"
#define SONOS_TAG_NEW_PLAY_MODE "NewPlayMode"

// State:
/*
<u:GetTransportInfoResponse>
  <CurrentTransportState>[PLAYING/PAUSED_PLAYBACK/STOPPED]</CurrentTransportState>
  <CurrentTransportStatus>[OK/ERROR]</CurrentTransportStatus>
  <CurrentSpeed>1</CurrentSpeed>
</u:GetTransportInfoResponse>
*/

#define SONOS_TAG_GET_MEDIA_INFO "GetMediaInfo"
#define SONOS_TAG_GET_MEDIA_INFO_RESPONSE "u:GetMediaInfoResponse"
#define SONOS_TAG_MEDIUM_STATUS "PlayMedium"
#define SONOS_MEDIUM_NONE 1
#define SONOS_MEDIUM_NONE_VALUE "NONE"
#define SONOS_MEDIUM_LINEIN 2
#define SONOS_MEDIUM_LINEIN_VALUE "LINE-IN"
#define SONOS_MEDIUM_NETWORK 3
#define SONOS_MEDIUM_NETWORK_VALUE "NETWORK"
#define SONOS_TAG_ARTIST_STATUS "CurrentURIMetaData"

#define SONOS_TAG_GET_TRANSPORT_INFO "GetTransportInfo"
#define SONOS_TAG_GET_TRANSPORT_INFO_RESPONSE "u:GetTransportInfoResponse"
#define SONOS_TAG_CURRENT_TRANSPORT_STATE "CurrentTransportState"
#define SONOS_STATE_PLAYING 1
#define SONOS_STATE_PLAYING_VALUE "PLAYING"
#define SONOS_STATE_PAUSED 2
#define SONOS_STATE_PAUSED_VALUE "PAUSED_PLAYBACK"
#define SONOS_STATE_STOPPED 3
#define SONOS_STATE_STOPPED_VALUE "STOPPED"

