Frank-Bemelman/ESP32-Sonos-Jukebox-V3/code/SonosUPnP.h
struct TrackInfo
{
  uint16_t number;
  uint32_t duration;
  uint32_t position;
  char *uri;
  char *trackmetadata; // hier komt de artiest en track titel terecht - frank - 21mei2020
};

struct FullTrackInfo // JV new, pass text-info as char string
{
  uint16_t number;
  char *duration;
  char *position;
  char *creator;
  char *title;
  char *album;
  char *artist;
};


struct SonosInfo // JV new, pass text info as Char string
{
  uint16_t number;
  char *uid;        // Rincon-xxxx 32 bytes
  char *serial;      // 16 bytes serialnumber short - no '-'
  char *seriesid;   // Series ID or Sonos Type - 16bytes
  char *zone;        // Zone name - 32 bytes
  char *medium;      // medium - network, linein etc
  char *status;      // Status - play/stop/pause etc
  char *playmode;    // playmode, see SONOS_PLAY_MODE definitions
  char *source;      // source, defined in URI , see  SONOS_SOURCE definitions
  };



struct MediaInfo
{
  uint16_t numberTracks;
  char *uri;
  char *uriMeta;
};

// https://developer.sonos.com/reference/sonos-music-api/getmediametadata/
// http://blog.travelmarx.com/2010/06/exploring-sonos-via-upnp.html
#define SONOS_TAG_GET_MEDIAMETADATA "GetMediaMetadata"        // frank 24JUL20
#define SONOS_TAG_GET_MEDIAMETADATARESPONSE "GetMediaMetadataResponse"  // frank 24JUL20
#define SONOS_TAG_GET_MEDIAMETADATARESULT "GetMediaMetadataResult"  // frank 24JUL20
#define SONOS_TAG_ID "Id"  // frank 24JUL20
#define SONOS_TAG_TITLE "Title"  // frank 24JUL20

class SonosUPnP
{

  public:

    SonosUPnP(WiFiClient client, void (*ethernetErrCallback)(void));

    void setAVTransportURI(IPAddress speakerIP, const char *scheme, const char *address);
    void seekTrack(IPAddress speakerIP, uint16_t index);
    void seekTime(IPAddress speakerIP, uint8_t hour, uint8_t minute, uint8_t second);
    void setPlayMode(IPAddress speakerIP, uint8_t playMode);
    void play(IPAddress speakerIP);
    void playFile(IPAddress speakerIP, const char *path);
    void playHttp(IPAddress speakerIP, const char *address);
    void playRadio(IPAddress speakerIP, const char *address, const char *title);
    void playLineIn(IPAddress speakerIP, const char *speakerID);
    void playQueue(IPAddress speakerIP, const char *speakerID);
    void playConnectToMaster(IPAddress speakerIP, const char *masterSpeakerID);
    void disconnectFromMaster(IPAddress speakerIP);
    void stop(IPAddress speakerIP);
    void pause(IPAddress speakerIP);
    void skip(IPAddress speakerIP, uint8_t direction);
    void setMute(IPAddress speakerIP, bool state);
    void setVolume(IPAddress speakerIP, uint8_t volume);
    void setVolume(IPAddress speakerIP, uint8_t volume, const char *channel);
    void setBass(IPAddress speakerIP, int8_t bass);
    void setTreble(IPAddress speakerIP, int8_t treble);
    void setLoudness(IPAddress speakerIP, bool state);
    void setStatusLight(IPAddress speakerIP, bool state);
    void addPlaylistToQueue(IPAddress speakerIP, uint16_t playlistIndex);
    void addTrackToQueue(IPAddress speakerIP, const char *scheme, const char *address);
    void removeAllTracksFromQueue(IPAddress speakerIP);
    uint8_t CheckUPnP(IPAddress *List,int Listsize); // new JV uPnP IPlist check by SSDP over UDP

    
    #ifndef SONOS_WRITE_ONLY_MODE
    
    void setRepeat(IPAddress speakerIP, bool repeat);
    void setShuffle(IPAddress speakerIP, bool shuffle);
    void toggleRepeat(IPAddress speakerIP);
    void toggleShuffle(IPAddress speakerIP);
    void togglePause(IPAddress speakerIP);
    void toggleMute(IPAddress speakerIP);
    void toggleLoudness(IPAddress speakerIP);
    uint8_t getState(IPAddress speakerIP,char *buf); // new JV : string passthrough
    uint8_t getState(IPAddress speakerIP);
    uint8_t getMedium(IPAddress speakerIP,char *buf); // new JV  : string passthrough
    uint8_t getMedium(IPAddress speakerIP); // new JV 
    uint8_t getPlayMode(IPAddress speakerIP,char *buf); // new JV  : string passthrough
    bool getZone(IPAddress speakerIP,char *buf); // new JV  : string passthrough
    bool getSerial(IPAddress speakerIP,char *buf); // new JV  : string passthrough
    uint8_t getSource(IPAddress speakerIP,char *buf); // new JV  : string passthrough
    uint8_t getSource(IPAddress speakerIP);

    uint8_t getPlayMode(IPAddress speakerIP);
    bool getRepeat(IPAddress speakerIP);
    bool getShuffle(IPAddress speakerIP);
//    TrackInfo getTrackInfo(IPAddress speakerIP, char *uriBuffer, size_t uriBufferSize);
    TrackInfo getTrackInfo(IPAddress speakerIP, char *uriBuffer, size_t uriBufferSize, char *metaBuffer, size_t metaBufferSize);

// FB 7okt2020
    MediaInfo getMediaInfo(IPAddress speakerIP, char *uriBuffer, size_t uriBufferSize, char *metaBuffer, size_t metaBufferSize);

    uint16_t getTrackNumber(IPAddress speakerIP);
    void getTrackURI(IPAddress speakerIP, char *resultBuffer, size_t resultBufferSize);
    void getTrackCreator(IPAddress speakerIP, char *resultBuffer, size_t resultBufferSize); // new JV - parse XML Metadata attribute Creator
    void getTrackTitle(IPAddress speakerIP, char *resultBuffer, size_t resultBufferSize); // new JV - parse XML Metadata attribute Title
    void getTrackAlbum(IPAddress speakerIP, char *resultBuffer, size_t resultBufferSize); // new JV - parse XML Metadata attribute Album
    uint8_t getSourceFromURI(const char *uri);
    uint32_t getTrackDurationInSeconds(IPAddress speakerIP);
    uint32_t getTrackPositionInSeconds(IPAddress speakerIP);
    uint16_t getTrackPositionPerMille(IPAddress speakerIP);
    bool getMute(IPAddress speakerIP);
    uint8_t getVolume(IPAddress speakerIP);
    uint8_t getVolume(IPAddress speakerIP, const char *channel);
    bool getOutputFixed(IPAddress speakerIP);
    int8_t getBass(IPAddress speakerIP);
    int8_t getTreble(IPAddress speakerIP);
    bool getLoudness(IPAddress speakerIP);
    
    FullTrackInfo getFullTrackInfo(IPAddress speakerIP);       // 18 mei nu starten alles ombouwen naar handiger data ophalen
    SonosInfo getSonosInfo(IPAddress speakerIP); // new JV - parse Get status/zp XLM

