Frank-Bemelman/ESP32-Sonos-Jukebox-V3/code/SonosUPnP.h
// frank 30-jun-22
    int getSonosPlayLists(IPAddress speakerIP);
    int getSonosPlayLists2(IPAddress speakerIP);
    
    #endif

  private:

    WiFiClient ethClient;      

    void (*ethernetErrCallback)(void);
    void seek(IPAddress speakerIP, const char *mode, const char *data);
    void setAVTransportURI(IPAddress speakerIP, const char *scheme, const char *address, PGM_P metaStart_P, PGM_P metaEnd_P, const char *metaValue);
    void upnpSet(IPAddress ip, uint8_t upnpMessageType, PGM_P action_P);
    void upnpSet(IPAddress ip, uint8_t upnpMessageType, PGM_P action_P, const char *field, const char *value);
    void upnpSet(IPAddress ip, uint8_t upnpMessageType, PGM_P action_P, const char *field, const char *valueA, const char *valueB, PGM_P extraStart_P, PGM_P extraEnd_P, const char *extraValue);
    bool upnpPost(IPAddress ip, uint8_t upnpMessageType, PGM_P action_P, const char *field, const char *valueA, const char *valueB, PGM_P extraStart_P, PGM_P extraEnd_P, const char *extraValue);

// frank
    bool upnpPost2(IPAddress ip, uint8_t upnpMessageType, PGM_P action_P, const char *field1, const char *valueA, const char *field2, const char *valueB, const char *field3, const char *valueC, const char *field4, const char *valueD, const char *field5, const char *valueE, const char *field6, const char *valueF);

    const char *getUpnpService(uint8_t upnpMessageType);
    const char *getUpnpEndpoint(uint8_t upnpMessageType);
    void ethClient_write(const char *data);
    void ethClient_write_P(PGM_P data_P, char *buffer, size_t bufferSize);
    void ethClient_stop();
    void readback_IP(IPAddress *IPa,char* buf,char pointer,char bufsize); // New JV : readback IP from (UDP)buffer
    bool upnpGetzp(IPAddress ip); // New JV GET command status/zp  


    #ifndef SONOS_WRITE_ONLY_MODE

    MicroXPath_P xPath;
    void ethClient_xPath(PGM_P *path, uint8_t pathSize, char *resultBuffer, size_t resultBufferSize);
    void ethClient_xPath2(PGM_P *path, uint8_t pathSize, char *resultBuffer, size_t resultBufferSize); // modified version to search/parse in Metadata
    void upnpGetString(IPAddress speakerIP, uint8_t upnpMessageType, PGM_P action_P, const char *field, const char *value, PGM_P *path, uint8_t pathSize, char *resultBuffer, size_t resultBufferSize);
    uint32_t getTimeInSeconds(const char *time);
    uint32_t uiPow(uint16_t base, uint16_t exp);
    uint8_t convertMedium(const char *input);
    uint8_t convertState(const char *input);
    uint8_t convertPlayMode(const char *input);
    uint8_t convertMetaData(char *input ); 


    #endif
};

#endif

//#ifdef ESP8266  //has no strlcpy_P

/* size_t ICACHE_FLASH_ATTR strlcpy_P(char* dest, const char* src, size_t size) {
    const char* read = src;
    char* write = dest;

*/
